app/views/packs/index.html.erb


<% @packs = Pack.all %>
---
SELECT "packs".* FROM "packs"