app/controllers/packs_controller.rb

SELECT "packs".* FROM "packs"
---
	def index
		@packs = Pack.all

SELECT  "packs".* FROM "packs" WHERE "packs"."id" = ? LIMIT 1  [["id", 13]]
---
	def show
		@packs = Pack.find_by(id: params["id"])